Revit 2027 API
CameraInfo.HorizontalExtent Property
 Distance between left and right planes on the target plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HorizontalExtent { get; }
Public ReadOnly Property HorizontalExtent As Double
	Get
public:
property double HorizontalExtent {
	double get ();
}
member HorizontalExtent : float with get
Property Value
Double
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace